Revit 2024 API
HostObjectSubcomponentInfo Class
 A class that contains roof or floor slab information, calculated by ExporterIFCUtils.ComputeSubcomponents().
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class HostObjectSubcomponentInfo : IDisposable
Visual Basic
Public Class HostObjectSubcomponentInfo _
	Implements IDisposable
Visual C++
public ref class HostObjectSubcomponentInfo : IDisposable
Remarks
 A slab is an extrusion with one outer and no inner base profile curve loops, created by extruding the base profile loop in the direction Plane.Normal a distance given by the Depth value.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.HostObjectSubcomponentInfo
See Also
HostObjectSubcomponentInfo Members
Autodesk.Revit.DB.IFC Namespace